---
kind: method
id: M:Autodesk.Revit.DB.PaperSourceSet.GetEnumerator
source: html/a6c972ff-dc8f-38ff-07ed-2f6fd5eb83a3.htm
---
# Autodesk.Revit.DB.PaperSourceSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.